{
    "appTitle": "Dinosaurs App",
    "imageBasePath": "./images/",
    "dinosaurs": {
        "trex": {
            "name": "Tyrannosaurus Rex",
            "img": "trex.jpg",
            "desc": "Tyrannosaurus (means 'tyrant lizard,' from Ancient Greek tyrannos which means 'tyrant,' and sauros which means 'lizard'[1]) is a genus of coelurosaurian theropod dinosaur. The species Tyrannosaurus rex (rex meaning 'king' in Latin), commonly abbreviated to T. rex, is a fixture in popular culture. The T. rex lived throughout what is now western North America, which then was an island continent named Laramidia. Tyrannosaurus had a much wider range than other tyrannosaurids. Fossils are found in a variety of rock formations dating to the Maastrichtian age of the upper Cretaceous Period, 67 to 66 million years ago.[2] It was among the last non-avian dinosaurs to exist before the Cretaceous–Paleogene extinction event."
        },
        "iguanodon": {
            "name": "Iguanodon",
                    "img": "iguanodon.jpg",
                    "desc": "Iguanodon (meaning 'iguana-tooth') is a genus of ornithopod dinosaur that existed roughly halfway between the first of the swift bipedal hypsilophodontids of the mid-Jurassic and the duck-billed dinosaurs of the late Cretaceous. While many species have been classified in the genus Iguanodon, dating from the late Jurassic Period to the late Cretaceous Period of Asia, Europe, and North America, research in the first decade of the 21st century suggests that there is only one well-substantiated species: I. bernissartensis, which lived from the late Barremian to the earliest Aptian ages[1] (Early Cretaceous) in Belgium and possibly elsewhere in Europe, between about 126 and 125 million years ago. Iguanodon were large, bulky herbivores. Distinctive features include large thumb spikes, which were possibly used for defence against predators, combined with long prehensile fifth fingers able to forage for food."
        },
        "archaeopteryx": {
            "name": "Archaeopteryx",
                    "img": "archaeopteryx.jpg",
                    "desc": "Archaeopteryx, sometimes referred to by its German name Urvogel ('original bird' or 'first bird'), is a genus of early bird that is transitional between feathered dinosaurs and modern birds. The name derives from the ancient Greek (archaios) meaning 'ancient', and (pteryx), meaning 'feather' or 'wing'. Since the late nineteenth century, it had been generally accepted by palaeontologists, and celebrated in lay reference works, as being the oldest known bird (member of the group Avialae).[1] However, older potential avialans have since been identified, including Anchiornis, Xiaotingia, and Aurornis.[2]"
        },
        "apatosaurus": {
            "name": "Apatosaurus",
                    "img": "apatosaurus.jpg",
                    "desc": "Apatosaurus, sometimes known by the popular synonym Brontosaurus, is a genus of sauropod dinosaur that lived from about 154 to 150 million years ago, during the Jurassic Period (Kimmeridgian and early Tithonian ages).[1] It was one of the largest land animals known to have ever existed, with an average length of 23 m (75 ft) and a mass of at least 16 metric tons (18 short tons).[2] Fossils of these animals have been found in Nine Mile Quarry and Bone Cabin Quarry in Wyoming and at sites in Colorado, Oklahoma and Utah, present in stratigraphic zones 2–6.[3]"
        }
    }
}
